{
    "name": "Daniel Maricic",
    "contact": "<a href='tel:+34632321884'>+34 6 3232 1884</a> <a href='mailto:daniel@woss.io'>daniel@woss.io</a> <a href='http://woss.io'>https://woss.io</a>",
    "mainHeading": "General",
    "sections": [{
            "title": "Personal Information",
            "fields": [
                [
                    "Name",
                    "Daniel Maricic"
                ],
                [
                    "Languages",
                    "Croatian, English (fluent), Spanish(basic conversation)"
                ],
                [
                    "Hobbies",
                    "Photography, cosmology, pottery and art ..."
                ]
            ]
        },
        {
            "title": "Summary",
            "largeList": [
                "I'm a full-stack developer and Scrum master with rich IT background.",
                "I enjoy learning and doing the necessary things myself when there is a need for it. This has led me to have the ability to fill multiple roles in an organization and to understand and apply a wide range of technologies for given tasks. This includes building the product from ground up including APIs, frontends and system administration.",
                "I enjoy working at a free pace, but sometimes, if needed,  9-5 isn't that bad.  I can put the necessary time into solving any problem I'm facing, no matter how tough and frustrating is. When I get the time to think of a problem properly I can come up with creative new suggestions on how to get the necessary results.",
                "I take pride in my ability to choose the right tool for the job, deciding when a homegrown solution is needed and when a 3rd party solution is much more cost-effective. I don't choose technologies just because I have a history with them, or because \"everyone uses them\", I choose technologies because they are perfect for the job."
            ]
        },
        {
            "title": "Recent experience",
            "largeList": [
                "For last 6 months, I've been focusing on building the product without the need to manage server infrastructure. This is known as 'serverless'.  After testing and trying 3 providers I've settled with AWS and I didn't regret it. I can proudly say that I am very well versed in this approach as well.",
                "I've been working heavily on Python and Go, with some JavaScript on the side. I'm also quite comfortable with Google Cloud Platform, Cordova (cross-platform mobile application framework), and continuous integration & delivery systems.",
                "I'm most comfortable in small to medium-sized startups, where I like to take a large role and take lots of responsibility. I've been designing software for medium sized server environments with dozens of servers for years, ensuring cost-effective scalability and high availability, while implementing the 'Blue-Green Deployment'",
                "I have done everything from managing product backlog, building product prototypes. I am a big fan of Infrastructure as Code (IaC), and DevOps practices in general."
            ]
        },
        {
            "title": "Technical skills",
            "fields": [
                [
                    "Programming languages",
                    "Python, Go, Lua, PHP, Bash Shell, JavaScript (Vanilla and ES6, JSX), HTML, CSS & LESS & SASS, (No)SQL ..."
                ],
                [
                    "Frameworks",
                    "Falcon, Django, React, React Native, AngularJs, Firebase ..."
                ],
                [
                    "Operating systems",
                    "Linux (CentOS, Debian/Ubuntu), OS X, Windows"
                ],
                [
                    "DevOps tools",
                    "Lambda (AWS,Google, Webtasks, Kubeless), Serverless, GraphQL, Kubernetes, Docker, Jenkins, Travis CI, Vagrant, SaltStack ..."
                ],
                [
                    "Server environments",
                    "Google Cloud Platform, Amazon Web Services ..."
                ],
                [
                    "Data",
                    "MongoDB, MySQL/MariaDB, memcache, ElasticSearch, Sphinx, IndexedDb, Redis ..."
                ],
                [
                    "Other",
                    "Machine Learning (Tensorflow, SciKit), New Relic, Nginx, Apache, Git, Mercurial ..."
                ]
            ]
        },
        "-",
        "Employment History",
        {
            "title": "SevenSignals Ltd - Owner",
            "duration": "08/2015 - current",
            "large": "<p>Consulting for various companies helping them to bring their ideas to life using innovative approach and battle-tested tools.</p>"
        },
        {
            "title": "Sensio.photo",
            "duration": "10/2017 - current",
            "large": "<p>Architecting the eco-system for the upcoming prototype written with Javascript using Serverless approach for the backend with GraphQL powered API and LUA based plugin for Lightroom.</p>"
        },
        {
            "title": "Screen.io Ltd - Senior consultant",
            "duration": "09/2017 - 12/2017",
            "large": "<p>Writing documentation and creating the eco-system for the new version of the existing product. Creating the prototype of the new version of chat component with Firebase and Material design with multitenancy ability.</p>"
        },
        {
            "title": "Digital Living Ltd - Senior developer",
            "duration": "05/2017 - 10/2017",
            "large": "<p>Helping to build a product prototype for the housing companies based on semantic web. I was involved in architectural meetings and decisions that would shape the core structure of the project. I also implemented DB and system functionality for one of the core systems in python, NoSQL with accompanying client written with React and Material Design.</p>"
        },
        {
            "title": "Nord Software Ltd - React developer",
            "duration": "02/2017 - 05/2017",
            "large": "<p>I helped Nord Software with frontend project written with React JS and D3 as Javascript components and Pure as CSS component</p>"
        },
        {
            "title": "Biddl Ltd - Senior Developer",
            "duration": "10/2015 - 02/2017",
            "large": "<p>Building a Cordova/PhoneGap-based mobile shopping game for Android and iOS in a team of five developers.</p><p>My role was implementing new features, doing QA in both backend and the mobile app clients (<a href=\"https://www.google.com/url?q=https://play.google.com/store/apps/details?id%3Dcom.biddl.biddl&amp;sa=D&amp;ust=1496329517690000&amp;usg=AFQjCNFV8ekmAwk-gVmEqiaFcCZIGgPpoA\">Android</a>, <a href=\"https://www.google.com/url?q=https://itunes.apple.com/us/app/biddl/id1022341873?mt%3D8&amp;sa=D&amp;ust=1496329517690000&amp;usg=AFQjCNHIbA4P_XSIcAcIug1wZhk_VSqyWg\">iOS</a>) as well as building a management tool on AngularJS. The assignment also included implementation of a REST API of image processing service that is used for most of the image processing. Most of the backend work was done in Python.</p><p>The assignment included:</p><ul><li>Software and database architecture design</li><li>Frontend software development</li><li>Backend software development</li><li>Testing &amp; QA, Test Automation, DevOps</li></ul><p>Tools used in the assignment:</p><ul><li>Frontend: Cordova/PhoneGap, JavaScript, Angularjs, Karma, PixiJS</li><li>Backend: Python, Go, Salt, Redis, Memcached, Elasticsearch</li></ul><p>See more: <a href=\"https://www.google.com/url?q=https://itunes.apple.com/us/app/biddl/id1022341873?mt%3D8&amp;sa=D&amp;ust=1496329517696000&amp;usg=AFQjCNGCnVW_p9XoAmBKSWLhxcy6_fkrKQ\">Biddl on App Store</a>, <a href=\"https://www.google.com/url?q=https://play.google.com/store/apps/details?id%3Dcom.biddl.biddl&amp;sa=D&amp;ust=1496329517697000&amp;usg=AFQjCNGGOBCc0N7guUTmnXUr21qDvJWgkg\">Biddl on Google Play</a></p>"
        },
        {
            "title": "Nord Software Ltd - Senior Developer and DevOps",
            "duration": "01/2014 - 10/2015",
            "large": "<ul><li><a href=\"#GameRefinery-Ltd---Project-lead---Senior-Developer\">GameRefinery</a></li><li><a href=\"#Adoveo---Ratataa---Senior-Developer\">Adoveo / Ratataa / Mobilityalley AB </a></li><li><a href=\"#Dovre-Group-Oyj---Senior-Developer\">Dovre Group</a></li><li><a href=\"https://www.google.com/url?q=http://rapidcampaign.com&amp;sa=D&amp;ust=1496329517705000&amp;usg=AFQjCNGPHXS6zufpMvPH9t0iOG-1bUX7fA\">RapidCampaign</a>&nbsp;/ <a href=\"https://www.google.com/url?q=http://nearme.fi/&amp;sa=D&amp;ust=1496329517706000&amp;usg=AFQjCNHYq8SmYmmkxa862nchoSSMMmgsmw\">NearMe</a>&nbsp;&ndash; Backend programming with Symphony (PHP)</li><li><a href=\"https://www.google.com/url?q=https://www.limiitti.fi/&amp;sa=D&amp;ust=1496329517707000&amp;usg=AFQjCNEUhBDf1PypDlRu6jm2eohpriFg5A\">Limiitti</a>&nbsp;- Backend programming with Yii (PHP)</li></ul>"
        },
        {
            "title": "GameRefinery Ltd - Project lead & Senior Developer",
            "duration": "12/2014 - 10/2015",
            "large": "<p>Building a SaaS platform tool for the analysis of mobile games and the prediction of mobile games commercial potential before their launch. The application was built in four-man agile (Scrum) team in close collaboration with the customer.</p><p>The assignment included:</p><ul><li>Software and database architecture design</li><li>Backend software development</li></ul><p>Tools used in the assignment:</p><ul><li>Lumen PHP framework</li><li>AngularJS</li><li>AWS</li></ul>"
        },
        {
            "title": "Adoveo / Ratataa - Senior Developer",
            "duration": "01/2014 - 11/2014",
            "large": "<p>Adoveo interactive video advertising that is used by brands such as Coca-Cola, Systembolaget, Texas Longhorn &amp; Puma.</p><p>The assignment included:</p><ul><li>Frontend &amp; Backend software development:</li><li>Building campaigns using the Adoveo system</li><li>Implementing API for third party service that is used to encode the videos</li><li>Setting up servers with full provisioning using Puppet</li><li>Building campaigns include following:</li></ul><ul><li>building/creating banners</li><li>encoding videos</li><li>setting up demos and tracking codes</li><li>setting up the server</li></ul><ul><li>Programming a new reseller portal for Ratataa</li><li>Programming the new backend for Ratataa:</li></ul><ul><li>Building new functionality for flow advertising modes</li><li>Creating additional security-related features</li></ul><ul><li>Creating a system to automate building campaigns &ndash; to provision servers and assign subdomains</li></ul><p>Tools used in the assignment:</p><ul><li>Yii PHP Framework, Sails.js, MongoDB, Websockets, HeyWatch API, Phundament</li></ul>"
        },
        {
            "title": "Dovre Group Oyj - Senior Developer",
            "duration": "01/2014 - 10/2014",
            "large": "<p>Dovre Group is a global provider of project management services. Dovre Club is an exclusive club for Oil and Gas professionals. The objective is to help professionals, find the next project job that suits their skills, experiences, and availability.</p><p>The assignment included:</p><ul><li>Frontend &amp; Backend software development</li><li>Project lead in Admin Dashboard project</li></ul><p>Tools used in the assignment:</p><ul><li>Yii PHP Framework, jQuery, Twitter Bootstrap</li></ul>"
        },
        {
            "title": "Ferratum Oyj - Senior Software Designer",
            "duration": "09/2012 - 12/2013",
            "large": "<p>Ferratum is an international provider of mobile consumer loans. I have been working as a senior software designer with multiple roles in developing, architecting new and supporting the company&rsquo;s internal system, as well as Lead Scrum Master helping other developers make the transition to Scrum.</p><p>Tasks at the company:</p><ul><li>Attending and holding education of Scrum for developers, helping them to make the transition to Scrum.</li><li>Support, maintenance, and development of existing systems</li><li>Improving IT workflows, processes, implementing standards and holding Lead Scrum Master role.</li></ul><p>Tools used in the company:</p><ul><li>PHP (Yii and an in-house framework), HTML5, CSS, jQuery</li></ul>"
        },
        {
            "title": "Snoobi Ltd - Software Designer",
            "duration": "04/2011 - 09/2012",
            "large": "<p>Snoobi is a Finnish web analytics consultancy company, providing web analytics information to different B2B clients based on their own web analytics product, Snoobi Analytics. I was working with the core Snoobi Analytics product as well as the company&rsquo;s ERP system, built with Symfony2.</p><p>Tasks at the company:</p><ul><li>Developing new features for the company's web analytics product</li><li>Developing and maintaining the company&rsquo;s internal ERP system built on top of Symfony2 with an integration with SalesForce CRM, including:</li></ul><ul><li>Full client's payment history</li><li>Manipulation of client data</li><li>Possibility of ordering new products, upgrading products and canceling products for a client</li></ul><p>Tools used in the company:</p><ul><li>PHP (Symfony2), MySQL, HTML5, CSS, jQuery</li></ul>"
        },
        {
            "title": "Adria24 GmbH - Software Developer",
            "duration": "06/2010 - 12/2010",
            "large": "<p>A project that started in Germany and was then moved to Croatia in the field of Tourism.</p><p>Adria24 was one of 10 biggest Croatian travel agencies, including over 100 satellite sites of specialized destinations across the Croatian coastline. Websites are powered by a backend built with Zend and a custom CMS that is connected to booking system with VOIP integration. All 100 satellite sites are connected from a central source.</p><p>Tasks at the company:</p><ul><li>Code Cleanup</li><li>Improving booking system</li><li>Working on new framework based on Zend</li><li>Database developing and design</li><li>Building various modules on top of Tomato Zend CMS</li></ul><p>Tools used in the company:</p><ul><li>PHP (Zend), MySQL, HTML, CSS, JavaScript, jQuery</li></ul>"
        }
    ]
}